{"name":"emi.storm","version":"1.7.0","documentationLinks":["http:\/\/www.eu-emi.eu\/kebnekaise-products\/-\/asset_publisher\/4BKc\/content\/storm-se?redirect=http%3A%2F%2Fwww.eu-emi.eu%2Fkebnekaise-products%3Fp_p_id%3D101_INSTANCE_4BKc%26p_p_lifecycle%3D0%26p_p_state%3Dnormal%26p_p_mode%3Dview%26p_p_col_id%3Dcolumn-2%26p_p_col_pos%3D1%26p_p_col_count%3D2"],"target":[{"id":45,"productId":66,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/updates","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=2529","status":1}],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"The StoRM service is a storage resource manager for generic disk based storage systems separating the\n\ndata management layer from the underlying storage systems. ","releaseDate":"2011-08-01 11:50:19","majorVersion":1,"minorVersion":7,"revisionVersion":0,"releaseNotes":"\n\nStoRM-Front-End\n\n    * What's new\n\n          o First storm-frontend-server release in EMI. Previous releases are available via INFN-Grid\n\n          o Fixed bug 107 (GGUS 70934)\n\n    * Installation and configuration\n\n          o To install storm-frontend-server, install its metapackage RPM: emi-storm-frontend-server-mp\n\n          o To configure storm-frontend-server use yaim on node se_storm_frontend. A good explanation of the required YAIM variable is available in \/opt\/glite\/yaim\/examples\/siteinfo\/services\/se_storm_frontend\n\n    * Known issues\n\n          o None\n\n\n\nStoRM-Back-end-Server\n\n    * What's new\n\n          o First storm-backend-server release in EMI. Previous releases are available via INFN-Grid\n\n          o tape support (features usable in combination with GEMSS, based on GPFS and TSM)\n\n          o sanity check at service startup\n\n          o http(s) file transfer protocol support\n\n          o Fixed bug 109 ((GGUS 68230)\n\n          o Fixed bug 106 (GGUS 65155)\n\n    * Installation and configuration\n\n          o To install storm-backend-server, install its metapackage RPM: emi-storm-backend-server-mp\n\n          o To configure storm-backend-server use yaim on node se_storm_backend. A good explanation of the required YAIM variable is available in \/opt\/glite\/yaim\/examples\/siteinfo\/services\/se_storm_backend\n\n          o If you configure other services with yaim on the same host always specify also se_storm_backend node\n\n    * Known issues : None\n\n\n\nStoRM-GridFTP-Server\n\n    * What's new\n\n          o First storm-gridfts-server release in EMI. Previous releases are available via INFN-Grid\n\n          o Fixed bug 108 (GGUS 70751)\n\n    * Installation and configuration\n\n          o To install storm-gridftp-server, install its metapackage RPM: emi-storm-gridftp-server-mp\n\n          o To configure storm-gridftp-server use yaim on node se_storm_gridftp. A good explanation of the required YAIM variable is available in \/opt\/glite\/yaim\/examples\/siteinfo\/services\/se_storm_gridftp\n\n          o The service needs to be installed on a machine on which storm file system is mounted.\n\n    * Known issues\n\n          o None\n\n\n\nStoRM-GridHTTPS-Server\n\n    * What's new\n\n          o First storm-gridhttps-server release.\n\n          o The storm gridhttps service is responsible to provide access to storm managed files via http and https protocol.\n\n          o It is able to manage plain requests and requests over SSL using an x509 certificate or an x509 certificate with VOMS extensions.\n\n          o For the requests providing a valid x509 certificate file access priviledges are verified in respect to the certificate owner and (if available) his FQANS.\n\n    * Installation and configuration\n\n          o To install storm-gridhttps-server install its metapackage RPM: emi-storm-gridhttps-mp\n\n          o To configure storm-gridhttps-server use yaim on node se_storm_gridhttps. A good explanation of the required YAIM variable is available in \/opt\/glite\/yaim\/examples\/siteinfo\/services\/se_storm_gridhttps\n\n          o The service uses ports 8443 and (by default) 8080, so open them on your firewall.\n\n          o The service needs to be installed on a machine on which storm file system is mounted.\n\n    * Known issues\n\n          o None\n\n\n\nStoRM-SRM-Client\n\n    * What's new\n\n          o First storm-srm-client release in EMI. Previous releases are available via INFN-Grid\n\n    * Installation and configuration\n\n          o To install storm-srm-client, install its metapackage RPM: emi-storm-srm-client-mp\n\n    * Known issues\n\n          o None\n\n","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.1.0","softwareConfigurationLink":""}