{"name":"emi.arc-infosys","version":"1.0.0","documentationLinks":["http:\/\/www.eu-emi.eu\/kebnekaise-products\/-\/asset_publisher\/4BKc\/content\/arc-infosys?redirect=http%3A%2F%2Fwww.eu-emi.eu%2Fkebnekaise-products%3Fp_p_id%3D101_INSTANCE_4BKc%26p_p_lifecycle%3D0%26p_p_state%3Dnormal%26p_p_mode%3Dview%26p_p_col_id%3Dcolumn-2%26p_p_col_pos%3D1%26p_p_col_count%3D2"],"target":[{"id":41,"productId":62,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/updates","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=2234","status":1}],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"The ARC middleware implements a scalable, production quality dynamic distributed information system.\n\nThe ARC information system has been deployed and being used in a large scale production environment since\n\nMay 2002. As of writing, the information system aggregates 70 resources providing Globus ToolkitTM40\n\nthousand CPUs and serves Globus ToolkitTM400 thousand jobs per month.","releaseDate":"2011-08-01 11:50:19","majorVersion":1,"minorVersion":0,"revisionVersion":0,"releaseNotes":"\n\n                          What's new:\n\n-----------\n\n* Support for publishing resource information using LDAP rendering of glue2 within ARIS.\n\n* Initial support for making ARIS act as a site-bdii (experimental).\n\n* Improved file locking in the EGIIS index server relay utility.\n\n* Stability fixes in both ARIS and EGIIS.\n\n* Improved handling of non-ascii information\n\n* The start-up script now handles bad shutdowns properly\n\n* Fix for publishing of draining remote grid-manager directories\n\n\n\nDeployment notes:\n\n-----------------\n\n* There are no changes in the Grid Monitor deployment.\n\n* The ARIS is deployed by installing the nordugrid-arc-aris package. If you are upgrading from an earlier release, the update should be automatic from any of the previous packages (nordugrid-arc-infosys-ldap, nordugrid-arc-nox-ldap-infosys).\n\n* The EGIIS is deployed by installing the nordugrid-arc-egiis package. If you are updating from an earlier release, the update from nordugrid-arc-nox-giis should be automatic. A meta package nordugrid-arc-information-index is also provided to easy deployment.\n\n* In order to keep publishing the same information as before in ARIS, no configuration changes are needed.\n\n* New configuration options were introduced for enabling  publishing new information in ARIS:\n\nIn order to enable or disable different information schemas in the output, the following variables can be set in the [infosys] section of the arc.conf (defaults as indicated below):\n\ninfosys_nordugrid=\"enable\"\n\ninfosys_glue12=\"disable\"\n\ninfosys_glue2_ldap=\"disable\"\n\n\n\nIn order to publish site bdii information a new [infosys\/site\/<sitename>] section should be added to the arc.conf configuration file, containing a unique_id option identifying the site and a url option giving the address to the resource bdii.\n\n* There are no configuration changes for EGIIS\n\n\n\nKnown Issues \n\n------------\n\n* none\n\n","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.1.0","softwareConfigurationLink":""}