{"name":"emi.glexec-wn","version":"1.2.2","documentationLinks":["http:\/\/wiki.nikhef.nl\/grid\/GLExec"],"target":[],"capabilities":[],"currentState":"deployed","technologyProvider":"EMI","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"gLExec is a program that acts as a light-weight 'gatekeeper'. gLExec takes Grid credentials as input. gLExec takes the local site policy into account to authenticate and authorize the credentials. gLExec will switch to a new execution sandbox and execute the given command as the switched identity. gLExec is also capable of functioning as a light-weight control point which offers a binary yes\/no result called the logging-only mode.\n","releaseDate":"2014-04-07 13:53:10","majorVersion":1,"minorVersion":2,"revisionVersion":2,"releaseNotes":"http:\/\/www.eu-emi.eu\/releases\/emi-3-monte-bianco\/updates\/-\/asset_publisher\/5Na8\/content\/update-14-03-03-2014-v-3-7-2-1#gLExec_wn_v_1_2_2","changeLog":"gLExec 0.9.9-0.9.11\n  * Bugfixes:\n    https:\/\/bugzilla.nikhef.nl\/show_bug.cgi?id=16 - gLExec incorrectly handles MALLOC_ variables in the input, failing instead of cleaning them. Additionally when cleaning the environment fails, this should be logged to the log, not the user.\n    gLExec also did not correctly handle extremely long variables in one case.\n    https:\/\/bugzilla.nikhef.nl\/show_bug.cgi?id=19 - When no log destination was set (neither syslog nor file) then gLExec should have behaved identical to setting syslog. However, openlog in that case was not always called before LCMAPS.\n     https:\/\/bugzilla.nikhef.nl\/show_bug.cgi?id=20 - The glexec-configure script lacked support for automatically adding the extra flag for cURL+NSS needed on RH6.\n  * Improvements:\n    Code cleanup, update to newer version of Jim Kupsch' safefile (now version 1.0.5) plus some additional patches for the use of id_t versus uid_t.\n    Update a few logging warnings and errors.\n    Update of the glexec-configure script.\n    Updates in glexec-lcas-lcmaps-compount-test.sh test script.\n\nLCMAPS 1.6.0-1.6.4\n  * Improvements:\n    In combination with the lcas-lcmaps-gt4-interface version 0.3.0 as desired username can be passed to the LCMAPS framework, useful for gsissh and gridftp.\n    Improved logging of VOMS related error messages.\n    Improved testing on double use of the same plugin.\n    Internal code cleanup, minor bug fixes, better cleanup of memory.\n    Provides now header file lcmaps_plugin_prototypes.h to be included by plugins, to provide the correct prototypes.\n\nlcmaps-plugins-basic 1.6.0 - 1.6.3\n  * Improvements:\n    Add support for the desired username for LCMAPS 1.6.0 or higher. In case of multiple matches, the one that matches the desired username is picked\n    Code cleanup and improvements\n\nlcmaps-plugins-c-pep 1.2.4 - 1.2.6\n  * Improvements:\n    New option: \"--treat-notapplicable-as-success\" or \"--banning-only-mode\"\n    With this new option set, a 'Not Applicable' result from the Argus server will not be interpreted as failure but success. This is necessary when Argus is used only for banning, since in that case there will be no matching 'permit' lines in the Argus policy. This option should ONLY be used in that case.\n    Code cleanup and improvements.\n\nlcmaps-plugins-tracking-groupid 0.1.1 - 0.1.2\n  * Improvements:\n    Code cleanup and improvements.\n\nlcmaps-plugins-verify-proxy 1.5.5 - 1.5.6\n  * Improvements:\n    More standard use of -capath (or --capath) is now also allowed, in addition to old-style -certdir\n    Certdir set by gLExec into LCMAPS is now honoured.\n    Improve some of the error logging.\n    Warn on a keystrength less than 1024.\n    Extensive code cleanup and minor bugfixes.\n\nlcmaps-plugins-voms 1.6.0 - 1.6.4\n  * Bug fixes:\n    https:\/\/bugzilla.nikhef.nl\/show_bug.cgi?id=17 - The ban_fqan plugin fails when a voms-less proxy is used: it should succeed.\n  * Improvements:\n    Add support the desired username for LCMAPS has version 1.6.0 or higher. The voms_localaccount and voms_poolaccount plugins will try to obtain a \"requested_username\" from the framework.\n    Code cleanup and minor bugfixes.\n    Add clarification in man-page for lcmaps_voms_poolgroup about the \"--map-to-secondary-groups\" option.\n","repositoryURL":"sw\/production\/umd\/3","distributionType":"UMD","distributionVersion":"3.6.0","softwareConfigurationLink":""}