{"name":"emi.unicore-uvos","version":"1.5.0","documentationLinks":["http:\/\/www.eu-emi.eu\/kebnekaise-products\/-\/asset_publisher\/4BKc\/content\/uvos?redirect=http%3A%2F%2Fwww.eu-emi.eu%2Fkebnekaise-products%3Fp_p_id%3D101_INSTANCE_4BKc%26p_p_lifecycle%3D0%26p_p_state%3Dnormal%26p_p_mode%3Dview%26p_p_col_id%3Dcolumn-2%26p_p_col_pos%3D1%26p_p_col_count%3D2"],"target":[{"id":114,"productId":135,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/updates","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=3189","status":1}],"capabilities":["Attribute Authority"],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"UNICORE VO Service (UVOS) is a client-server system, developed to be used as an additional tool for large distributed systems, providing a solution for grid users management. Grid systems, especially UNICORE grid middleware, are the mainspring of the UVOS system. UVOS can be used with different systems, however is designed primarily to support UNICORE grid middleware.","releaseDate":"2012-04-02 18:45:54","majorVersion":1,"minorVersion":5,"revisionVersion":0,"releaseNotes":"\n\nWhat's new:\n\n    Fixed bug with wrong ping query. This occurred with MySQL DB in log files.\n\n    Fixed bug: initdb script didn't ask for a confirmation when invoked on an already initialized db\n\n    Fixed bug: initdb script was quite often not initializing properly the HSQL DB.\n\n    Fixed bug: UVOS server doesn't load default attributes on startup\n\n    New feature: UVOS server has now a GLUE 2 WS endpoint, which can be queried to get information about the server. Currently only minimal information is made available, including the server version. In uvos-clc a new operation was added (getServerInfo) which can be used to query the server. Client documentation was updated to cover the new command.\n\n    New feature: For UVOS client and server web modules src.rpms are available.\n\n\n\nInstallation and configuration:\n\n    There were no changes in configuration files so the update should install without any problems. However it is advised (as always) to double check if there are any .rpmnew or .rpmsave files in the \/etc\/unicore\/uvos\/uvos-server and \/etc\/unicore\/uvos\/uvos-clc directories.\n\n\n\nKnown issues\n\n    None\n\n                          ","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.6.0","softwareConfigurationLink":""}