{"name":"emi.unicorex6","version":"4.2.0","documentationLinks":["http:\/\/www.eu-emi.eu\/emi-1-kebnekaise-updates\/-\/asset_publisher\/Ir6q\/content\/update-12-19-01-2012#UNICORE_X6_v_4_2_0_task_24436"],"target":[{"id":116,"productId":137,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/updates","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=3321","status":1}],"capabilities":["Job Execution"],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"The UNICORE\/X server is the central component of a UNICORE site. It hosts the services such as job submission, job management, storage access, and provides the bridge to the functionality of the target resources, e.g. batch systems or file systems.","releaseDate":"2012-04-02 18:45:54","majorVersion":4,"minorVersion":2,"revisionVersion":0,"releaseNotes":"\n\nWhat's new:\n\nThis is a minor update to the 6.4.1 release. There are quite a big number of bug fixes and improvements.\n\n - fix: filetransfer thread pool was not setup correctly\n\n - fix: BES status checks were slow in case of many jobs\n\n - fix: interactive script runtime limit was not correctly used\n\n   (SF bug #3436254)\n\n - fix: resource properties of BESFactory are readable for all authenticated\n\n   Grid certificates\n\n - fix: concurrent processing of jobs with many file transfers could \n\n   lead to errors\n\n - fix: HTTP proxy settings were not used (SF bug #3436456)\n\n - new feature: support for \"mailto:\" as stage-out protocol\n\n   (SF bug #3436692)\n\n - fix: waiting for exit code file on slow NFS volumes did not work\n\n - fix: use \"\/bin\/cp -r\" as default CP command\n\n - fix: always append \".\" to PATH in job script\n\n - improvement: make controllable whether pre\/post commands are executed on login node\n\n   (SF features #3243169)\n\n - fix: parent directories were not created when using file:\/\/ staging \n\n   (SF bug #3439595)\n\n - fix: metadata service lifetime did not match storage lifetime\n\n   (SF bug #3459449)\n\n - improvement: support for manipulating default file system ACLs (umask)\n\n   (SF enhancement #3380959)\n\n - improvement: allow for a recursive invocation of SetPermissions\n\n   (chmod, chgrp, setfacl) (SF enhancement #3380959) \n\n - improvement: filtering of files on SMS (turned on by default on the\n\n   shared SMS) hides only not owned and not accessible files. It is \n\n   possible to configure this feature for other than the default storages. \n\n   (SF enhancement #3315469)\n\n - improvement: auto-negotiation of server-to-server filetransfer \n\n   protocol (SF feature #1997613)\n\n - fix: default termination time from configuration is not used (SF bug #3409890)\n\n - improvement: metadata indexer takes into account existing metadata files\n\n - new feature: SCP is supported for data staging with username\/password\n\n   according to the \"HPC file staging profile\" (GFD.135) (SF feature #3411491)\n\n - improvement: .pem file(s) can be used as truststore (SF improvement #3383619)\n\n   Use \"file\" as truststore type to trust a single .pem file, use \"directory\" to\n\n   trust all .pem files in a directory.\n\n - improvement: keystore\/truststore type can be auto-detected\n\n - CIP Glue2 improvements: new Glue2 schema used, service version is published\n\n - support for the JobProject feature in JSDL (SF feature #3413236)\n\n - enhancement: added framework to invoke administrative actions via the AdminService\n\n   (SF enhancements #3390537)\n\n - enhancement: if available, information about active jobs per queue is published\n\n   in TSF resource properties (SF feature #3289424)\n\n - improvement: support for failing jobs from the incarnation tweaker\n\n   (SF enhancement 3409899)\n\n - improvement: BES reports job execution errors via activity status \n\n   (SF feature #3388902)\n\n - fix: when user changes the certificate, home and other storages are re-created\n\n - improvement: support JSDL FileSystemName element (SF enhancement #3419473)\n\n - fix: database errors are no longer suppressed (SF bug #3293201)\n\n - improvement: more stable operation on NFS filesystems since existence of staged files \n\n   on the worker node is checked\n\n - fix: warnings that PDP was unable to make a definitive decision (SF bug #3429753)\n\n\n\n - UNICORE Nagios probes are released\n\n\n\n\n\nInstallation and configuration: \n\nAfter updating the libraries, the UNICORE\/X server must be restarted.\n\n\n\nKnown Issues: none.\n\n                          ","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.6.0","softwareConfigurationLink":""}