{"name":"epel.gfal-lcg_util","version":"1.16.0","documentationLinks":["https:\/\/svnweb.cern.ch\/trac\/lcgutil\/"],"target":[{"id":240,"productId":518,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/3\/sl5\/x86_64\/updates","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=6352","status":1}],"capabilities":["Client Tools"],"currentState":"deployed","technologyProvider":"EPEL","contact":"alejandro.alvarez.ayllon@cern.ch","technicalContact":"alejandro.alvarez.ayllon@cern.ch","description":"\n\n      The Grid File Access Library (GFAL) is a library that offers to the user a POSIX-like interface to access data on various flavours of Storage Elements offering an SRM interface. GFAL is interfaced to SRM-compliant back-ends (both v1.1 and v2.2) and storage systems such as Castor, dCache or DPM in which case the relevant protocol is used transparently behind the scenes. Using information published in the information system, it resolves relevant abstract domain data\/file names so that the physical data access as well as the end-points of services are achievable transparently. It allows and unifies access to various types of items such as: LFN, GUID, SURL, SRM and TURL or local path. In addition, some of the crucial, yet common, backend calls are exposed through the library so that users are not limited to POSIX mapping to do specific calls e.g. to reserve space or pin a file. The pluggable architecture of the library permits dynamic change of the versions of some of the supported protocols (i.e. rfio, dCache) without need of redeployment.\n\n      ","releaseDate":"2014-01-29 12:39:01","majorVersion":1,"minorVersion":16,"revisionVersion":0,"releaseNotes":"\n\n          This is the last release of gfal \/ lcg-util including new functionality. The release is made in EPEL, and the corresponding rpms will be removed from EMI2 and EMI3 repositories.\n\n\n\n          gfal 1.16.0\n\n          BUG  LCGUTIL-146 lcg-la is not robust to \/\/\n\n          lcgutil 1.16.0\n\n          BUG  LCGUTIL-238 lcg-get-checksum fails - can't find zlib\n\n          NEW  LCGUTIL-71 Add support for other protocol than  file:\/\/ and  gsiftp:\/\/\n\n          srm-ifce 1.18.0\n\n\n\n          BUG  LCGUTIL-231 Copy_mdfilestatuses ignores createdAtTime and lastModificationTime\n\n          gridftp-ifce 2.3.1\n\n\n\n          IMPROVEMENT Replace globus wait with cond_timed_wait\n\n      ","changeLog":"\n\n          https:\/\/svnweb.cern.ch\/trac\/lcgutil\/wiki\/GFALRelease_1_16_0\n\n      ","repositoryURL":"sw\/production\/umd\/3","distributionType":"UMD","distributionVersion":"3.4.0","softwareConfigurationLink":""}