{"name":"emi.storm","version":"1.8.0","documentationLinks":["hhttp:\/\/www.eu-emi.eu\/emi-1-kebnekaise-updates\/-\/asset_publisher\/Ir6q\/content\/update-9-03-11-2011#StoRM_SE_v_1_8_0"],"target":[{"id":90,"productId":111,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/updates","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=3180","status":1}],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"The StoRM service is a storage resource manager for generic disk based storage systems separating the\n\ndata management layer from the underlying storage systems. ","releaseDate":"2011-12-19 12:08:42","majorVersion":1,"minorVersion":8,"revisionVersion":0,"releaseNotes":"\n\nStoRM service is composed by 5 sub-components (4 servers and 1 client), which are deployable in distinguished hosts. This release represents the second update of StoRM-SE in EMI-1. The first release was v1.7.0 and the first update was v1.7.1. It includes updates on: FE, BE, DIP, YAIM and GridHTTPSP (plugin). There is also a new component, storm-xmlrpc-c, that is a repackage of XMLRPC-C package version 1.25.10. This package is used at runtime by FE. Client, GridFTP and GridHTTPS are the same of 1.7.1 release. Checksum service will be released soon.\n\n\n\n \n\nStoRM-FrontEnd \n\nWhat's new\n\n    Second update of storm-frontend-server in EMI-1. Server version is now 1.7.2-1.\n\n    Fixed bugs:\n\n        @158: \"Storm frontend log contains debug information at INFO level\"\n\n        @166: \"Memory leak on BackEnd REST service calls\"\n\n            @169: \"xmlrpc-c sl5 distributed version has a memory leak that affects the FrontEnd\"\n\n\n\nInstallation and configuration\n\n    To install storm-frontend-server, install its metapackage RPM: emi-storm-frontend-server-mp\n\n    To configure storm-frontend-server use yaim on node se_storm_frontend. A good explanation of the required YAIM variable is available in \/opt\/glite\/yaim\/examples\/siteinfo\/services\/se_storm_frontend\n\nTo upgrade storm-frontend-server:\n\n    stop the service,\n\n    yum update storm-frontend-server\n\n    service storm-frontend-server restart.\n\n\n\nKnown issues\n\n    None\n\n \n\nStoRM-BackEnd-Server\n\nWhat's new\n\n    First update of storm-backend-server rin EMI-1. Server version is 1.8.0-1.\n\n    Fixed bugs:\n\n        @146: \"DIP get_size() incorrectly handles the info (kb insteadof bytes)\"\n\n        @147: \"!Glue2 GLUE2StorageShareCapacity* sizes always 0\"\n\n        @148: \"Available space reported by InfoService is always zero\"\n\n            @149: \"wrong yaim-storm version in the file \/opt\/glite\/yaim\/etc\/versions\/yaim-storm\"\n\n        @150: \"Wrong calculation of SA_AVAILABLE_SIZE_KB and SA_USED_SIZE_KB\"\n\n        @151: \"Missing check on variables initialization in config_gip_storm get_size\"\n\n        @162: \"!StoRM backend upgrade overwrites namespace.xml\"\n\n        @164: \"src BE rpm is wrong\"\n\n            @167: \"Backend service restart fail after host reboot\"\n\n            @170: \"mmlsquota output parsing error on \"grace-period\" field\"\n\n            @179: \"mysql-connector-java downloading failure\"\n\n            @181: \"StoRM backend age value reported bi srmPing is wrong\"\n\n    New (minor) Feature:\n\n        @175: \"Specify UsedSize at configuration-time\"\n\n        @177: \"Parsing of UsedSpace init file and update DB with values parsed\"\n\n        @178: \"Introduce YAIM variables and function to create used-space.ini\"\n\n            @185: \"logics of backend startup\"\n\n            @187: \"setting of the maximum number of open file descriptors\"\n\n\n\nInstallation and configuration\n\n    To install storm-backend-server, install its metapackage RPM: emi-storm-backend-server-mp\n\n    To configure storm-backend-server use yaim on node se_storm_backend. A good explanation of the required YAIM variable is available in \/opt\/glite\/yaim\/examples\/siteinfo\/services\/se_storm_backend\n\n    If you configure other services with yaim on the same host always specify also se_storm_backend node\n\nTo upgrade storm-backend-server:\n\n    stop the service,\n\n    yum update storm-backend-server\n\n    service storm-backend-server restart.\n\n    restart all frontend-servers installed\n\n\n\nKnown issues\n\n    None\n\n\n\nStoRM-GridFTP-Server \n\nWhat's new\n\n    Nothing. This component is the same of the previous release. Server version is 1.1.0-6.\n\n\n\nInstallation and configuration\n\n    To install storm-gridftp-server, install its metapackage RPM: emi-storm-gridftp-server-mp\n\n    To configure storm-gridftp-server use yaim on node se_storm_gridftp. A good explanation of the required YAIM variable is available in \/opt\/glite\/yaim\/examples\/siteinfo\/services\/se_storm_gridftp\n\n    The service needs to be installed on a machine on which storm file system is mounted.\n\n\n\nKnown issues\n\n    None\n\n\n\nStoRM-GridHTTPS-Server \n\nWhat's new\n\n    Nothing. This component is the same of the previous release. Server version is 1.0.4-1.\n\n \n\nInstallation and configuration\n\n    To install storm-gridhttps-server install its metapackage RPM: emi-storm-gridhttps-mp\n\n    To configure storm-gridhttps-server use yaim on node se_storm_gridhttps. A good explanation of the required YAIM variable is available in \/opt\/glite\/yaim\/examples\/siteinfo\/services\/se_storm_gridhttps\n\n    The service uses ports 8443 and (by default) 8080, so open them on your firewall.\n\n    The service needs to be installed on a machine on which storm file system is mounted.\n\n \n\nKnown issues\n\n    None\n\n\n\nStoRM-GridHTTPS-Plugin\n\n \n\nWhat's new\n\n    This component is the same of the previous release, except for a bug fix on update.\n\n    Fixed bugs:\n\n        @154 \"!GridHTTPs Plugin update removes the link to its jar from BackEnd jars folder\"\n\n\n\nInstallation and configuration\n\n    This component is installed as a dependency of BE. You should not install it by yourself.\n\n\n\nKnown issues\n\n    None\n\n\n\nStoRM-SRM-Client\n\nWhat's new\n\n    Nothing. This component is the same of the previous release.\n\n\n\nInstallation and configuration\n\n    To install storm-srm-client, install its metapackage RPM: emi-storm-srm-client-mp\n\n\n\nKnown issues\n\n    None\n\n\n\nStoRM-XMLRPC-C \n\nWhat's new\n\n    This component is a repackaging of XMLRPC-C from sourceforge ( http:\/\/xmlrpc-c.sourceforge.net\/ ).\n\n    The version repackaged is XMLRPC_1.25.10-1206.2181\n\n    The repackaging is needed because a memory leak occours in the release available with RH-SL5 repository.\n\n    See bug #735835 (submitted bug to RedHat and to XMLRPC-C development team)\n\n\n\nInstallation and configuration\n\n    This component is installed as a dependency of FE. You should not install it yourself.\n\n\n\nKnown issues\n\n    None\n\n\n\nDocumentation\n\nWhat's new\n\n    Documentation is updated with the new release 1.8.0\n\n    Fixed bugs:\n\n        @141: Admin guide for EMI users (Installation and Configuration)\n\n","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.4.0","softwareConfigurationLink":""}