{"name":"emi.wms","version":"3.3.4","documentationLinks":["http:\/\/www.eu-emi.eu\/emi-1-kebnekaise-updates\/-\/asset_publisher\/Ir6q\/content\/update-11-15-12-2011"],"target":[{"id":106,"productId":127,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/updates","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=3256","status":1}],"capabilities":["Job Scheduling"],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"The Workload Management System (WMS) comprises a set of grid middleware components responsible for the distribution and management of tasks across grid resources, in such a way that applications are conveniently, efficiently and effectively executed..","releaseDate":"2012-01-30 15:31:32","majorVersion":3,"minorVersion":3,"revisionVersion":4,"releaseNotes":"\n\nWhat's new\n\nThis is an update of WMS basically fixing what follows:\n\n    A problem with the proxy purger cron job which prevented, on ext3, new delegations for a certain DN after its 31999th submission\n\n    A glitch in querying data catalogues there were present also in the gLite versions\n\n    Wrong ownership of \/var and \/var\/log directories which were owned by the glite user. Please note that the fix applies to new installations. In case of update the ownership of these directories must be fixed manually (see below)\n\n    Issues with sandbox purging by the LogMonitor\n\n    A catch in ICE concerning job status change detection\n\n    GLUE2 publication. This also allows the publication of the WMS and EMI middleware release\n\n    JeMalloc, an optimized memory allocator, is automatically installed and used by the WM module\n\n    This update introduces also the Nagios probe for WMS. Documentation available at WMSProbe \n\n\n\nInstallation and configuration\n\nYaim (re)configuration is required after installation\/update. In case of co-location with the L&B, make sure that yaim is run also for the latter.\n\n\n\n    In case of update, before applying the update stop all the services. After the update (after yum update and after yaim configuration):\n\n        set the ownership of the directories \/var and \/var\/log to root.root\n\n        execute the cron job \/etc\/cron.d\/glite-wms-create-host-proxy.cron \n\n    In case of a clean install, after yaim configuration:\n\n        execute the cron job \/etc\/cron.d\/glite-wms-create-host-proxy.cron \n\n\n\n    In the configuration file \/etc\/glite-wms\/glite_wms.conf the following two parametes for the load_monitor must always have the same values, even if different from the default ones: \n\n\n\njobSubmit  = \"${WMS_LOCATION_SBIN}\/glite_wms_wmproxy_load_monitor --oper jobSubmit --load1 22 --load5 20 --load15 18 --memusage 99 --diskusage 95 --fdnum 1000 --jdnum 150000  --ftpconn 300\";\n\njobRegister  =  \"${WMS_LOCATION_SBIN}\/glite_wms_wmproxy_load_monitor --oper jobRegister --load1 22 --load5 20 --load15 18 --memusage 99 --diskusage 95 --fdnum 1000 --jdnum 150000 --ftpconn 300\";\n\n\n\nThe admin guide has been updated with the following information:\n\n    The location of the drain file has changed with respect to the gLite version\n\n    Configuration tips in case colocation with the LB \n\n\n\nCheck out the guide for more details.\n\n\n\nKnown issues\n\nAs said above, this update fixes a problem on ext3 with the proxy purger preventing new delegations for a certain user after her 31999th submission. Even with this fix, there are at any rate some minor issues on ext3:\n\n    a: there can be at most 31999 different users submitting to a certain WMS (very unlikely)\n\n    b: there can be at most 31999 valid (i.e. not expired) proxies for a certain user (the purging of the expired proxy files is done on the WMS by a cron job which runs every 6 hours) \n\n\n\nTo definitely avoid this issues, ext4 is needed. Nonetheless, re-creating new delegations each time without reusing them has to be considered a bad and not supported practice, so that what mentioned here only for the sake of clarity should be actually considered a non-issue more than a known issue.\n\n    In case of WMS+LB colocation, error \"no state in DB\" on glite-wms-job-submit means that the WMS has not been authorized in the L&B authorization file. Refer to the 'Installation and configuration\" section above to fix this issue.\n\n    If there are problems with purging, or the first output retrieval gives \"Warning - JobPurging not allowed (CA certificate verification failed)\", that means that the host proxy certificate has not been installed. Refer to the \"Installation and configuration\" section above to fix this issue. \n\nOn very high loads, kind of submitting 1k\/2k collections of 25 nodes with a frequency of 60 seconds, the following call to the L&B might require a not trivial time (wmproxy.log):\n\n\"WMPEventlogger::registerSubJobs\": Registering DAG subjobs to LB Proxy..\n\nIf this time is long enough to exceed the mod_fcgid IPCCommTimeout parameter, then the request will be terminated with the consequence of leaving the collection pending forever. Other than increasing IPCCommTimeout, check that L&B is properly doing its purging. Especially when in 'both' mode, the admin can act on the purging policy to make it more frequent. In proxy mode, the admin can eventually decide to turn off automatic purging of the jobs in terminal state (-G option of glite-lb-bkserverd).\n\n    The \"job feedback\", a newly introduced feature to replan jobs stuck at blocking queues, is far from being perfect, at this stage. Its use is encouraged to give us 'feedback'. The feedback is a mechanism that relies on the existence of a global synchronization token, so requiring the shallow resubmission feature enabled. For this reason, it must not be used with the deep resubmission enabled. \n\n                          ","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.5.0","softwareConfigurationLink":""}