{"name":"emi.lb","version":"3.1.0","documentationLinks":["http:\/\/www.eu-emi.eu\/emi-1-kebnekaise-updates\/-\/asset_publisher\/Ir6q\/content\/update-9-03-11-2011#LB_v_3_1_0"],"target":[{"id":102,"productId":123,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/updates","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=3179","status":1}],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"The Logging and Bookkeeping service (LB) tracks jobs in terms of events (important points of job life, e.g. submission, finding a matching CE, starting execution etc.) gathered from various WMS components as well as CEs (all those have to be instrumented with LB calls).","releaseDate":"2012-01-30 15:31:32","majorVersion":3,"minorVersion":1,"revisionVersion":0,"releaseNotes":"\n\nWhat's new:\n\n    An initial release of a nagios plugin to check the operation of an L&B server\n\n    Documentation -- the Test Plan -- has been updated with a description of the Nagios Plugin and a simple test of the plugin's operation.\n\n \n\nDeployment notes:\n\n    emi-lb metapackage is installed by yum.\n\n    yaim configuration requires, at the very least, setting MYSQL_PASSWORD, SITE_NAME and SITE_EMAIL in the site-info.def file.\n\n    Reconfiguration is required.\n\n    Reconfiguration using YAIM will restart the service automatically.\n\n    The emi-lb metapackage does not install the Nagios plugin. It (package emi-lb-nagios-plugins) can be installed separately.\n\n \n\nKnown Issues:\n\n    Due to faulty DNS over IPv6 resolution in the c-ares library (v. 1.6.0), L&B does not work in most scenarios involving IPv6-only machines. Upgrade c-ares to 1.7.3 and relaunch yaim to get full IPv6 functionality.\n\n    Background purge works and return code is handled correctly. It also results in a clean termination of a slave, though, which is currently reported by the master to syslog with priority 'Error' despite being harmless (The actual wording is 'Slave \\d exited with return code 1'). This does not pose a problem, just a false alarm for a person reading the logs.\n\n\n\n                          ","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.5.0","softwareConfigurationLink":""}