{"name":"emi.mpi","version":"1.2.0","documentationLinks":["http:\/\/www.eu-emi.eu\/emi-1-kebnekaise-updates\/-\/asset_publisher\/Ir6q\/content\/update-11-15-12-2011"],"target":[{"id":104,"productId":125,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/updates","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=3252","status":1}],"capabilities":["Parallel Job"],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"gLite MPI Utils","releaseDate":"2012-01-30 15:31:32","majorVersion":1,"minorVersion":2,"revisionVersion":0,"releaseNotes":"\n\nWhat's new:\n\n    Support for processor and memory affinity for MPICH2\n\n    Improved configuration, now files can be in several directories and local definitions can be included.\n\n    Bug Fixes:\n\n        NFS4 is not detected as shared fs (H)\n\n        Cleanup not invoked with cptoshared method (M)\n\n        mpiexec detection needs to be done earlier (M)\n\n        mpich2 startup ignores MPI_MPICH2_MPIEXEC_PARAMS (M)\n\n        readlink -f is not portable (used in cptoshared filedist) (L) \n\n    Updated documentation with new features and configuration changes. \n\n\n\nDeployment notes:\n\n    No special installation requirements, no need for restarting services.\n\n    YAIM plugin available for configuration in WN and CEs, reconfiguring the CE should fix\n\n    MPI execution requires the installation of additional MPI software (see manual) and may require also extra configuration of your CE and WN (e.g. passwordless SSH between nodes), check your batch system and MPI implementation for details\n\n    Accounting of MPI jobs requires a MPI implementation that provides tight integration with the batch system: OpenMPI in SGE and Torque\/PBS (may require recompilation of packages) or MPICH\/MPICH2 with OSC mpiexec in Torque\/PBS.\n\n    Nagios plugins for MPI require the existence of a working mpi compiler. \n\n\n\nKnown Issues:\n\n    Fine grained process mapping is not supported with Slurm or Condor schedulers.\n\n    Maui versions prior to 3.3.4 do not allocate correctly all the nodes for the execution of jobs (see GGUS #67870 and GGUS #57828).\n\n    MPD startup of MPICH2 jobs may fail if the .mpd.conf file is not properly copied to all WN (bug #49)\n\n    MPICH2 with hydra only supports ssh (bug #51) \n\n                          ","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.5.0","softwareConfigurationLink":""}