{"name":"emi.apel_parsers","version":"1.0.1","documentationLinks":["http:\/\/www.eu-emi.eu\/emi-1-kebnekaise-updates\/-\/asset_publisher\/Ir6q\/content\/update-8-14-10-2011"],"target":[{"id":96,"productId":117,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/updates","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=2991","status":1}],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"APEL (Accounting Processor for Event Logs) is a tool that gathers CPU accounting information by parsing batch system and blah accounting log files and inserts it into a local MySQL database. APEL then publishes the data into a centralised repository. APEL is composed of two components: the log parser and the publisher.\n\nThe log parser interprets log files to extract job information. Specifically, it processes the batch system (PBS, LSF, SGE or Condor) event log files and the blahd\/grid-jobmap accounting log files. Extracted data is stored within a local MySQL database. The log parser also makes LDAP queries of the CE to obtain the CPU performance figures for the worker node clusters.","releaseDate":"2012-01-30 15:31:32","majorVersion":1,"minorVersion":0,"revisionVersion":1,"releaseNotes":"\n\n                           What's new:\n\n    * SGE parser corrected to read CPU usage from field 36 of the log file rather than the sum of fields 14 & 15.\n\n    * LSF parser changed to allow configuration of whether CPU time is scaled according to the HostFactor field in the log file. If not, the scaling should be set in the BDII\/GIIS\/GRIS. By default, the APEL parser won't use the hostFactor value.\n\n    * APEL parsers now depending on mysql-connector-java package instead of mm-mysql.\n\n    * APEL client user guide and APEL parser administrator guide updated with latest changes. \n\n\n\nDeployment notes:\n\n    * None \n\n\n\nKnown issues:\n\n    * None \n\n                          ","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.5.0","softwareConfigurationLink":""}