{"name":"emi.arc-client","version":"1.0.0","documentationLinks":["http:\/\/www.eu-emi.eu\/kebnekaise-products\/-\/asset_publisher\/4BKc\/content\/arc-clients?redirect=http%3A%2F%2Fwww.eu-emi.eu%2Fkebnekaise-products%3Fp_p_id%3D101_INSTANCE_4BKc%26p_p_lifecycle%3D0%26p_p_state%3Dnormal%26p_p_mode%3Dview%26p_p_col_id%3Dcolumn-2%26p_p_col_pos%3D1%26p_p_col_count%3D2"],"target":[{"id":12,"productId":33,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/base","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=2233","status":1}],"capabilities":["Client Tools"],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"The new libarcclient makes extensive use of plugins for command handling. These plugins are handled by a\n\nset of higher level classes which thus are the ones to offer the plugin functionality to external calls. In this\n\nsection an overview of the library’s main functionality is given which also introduces the most important\n\nhigher level classes.","releaseDate":"2011-07-11 20:50:50","majorVersion":1,"minorVersion":0,"revisionVersion":0,"releaseNotes":"\n\n                           What's new:\n\n-----------\n\n* ARC Clients in EMI-1 \"Kebnekaise\" release is a major step forward with respect to previous releases, as it completes migration to the new code base. With this release the ng* clients are replaced by the arc* clients.\n\n* Introduction of a modular architecture, which comes to its power in the libarcclient and libarcdata2 libraries.\n\n* Compute client comes with plugins providing functionality for job submission, resubmission, and job management against the pre-WS ARC, A-REX, CREAM and any BES-based Execution Service (ES).\n\n* Compute client supports job migration between A-REX instances.\n\n* Compute client supports resource discovery based on EGIIS, ISIS and BDII index services.\n\n* Compute client offers matchmaking and ranking by shortest queue, clock speed, benchmark or data location.\n\n* Compute client offers job description translation between the XRSL, JSDL and JDL languages.\n\n* Modular libarcclient allows easy extension for additional services, ranking algorithms, or job description languages.\n\n* New plugins-based data library, libarcdata2, replaces previous data library.\n\n* Data access is now managed through DMCs, protocol-specific plugins.\n\n* New data clients (arcls, arccp, arcrm, arcsrmping) replace previous data clients (ngls, ngcp, ngrm, ngtransfer, ngstage, ngacl).\n\n* Improved default output for arcls, now closer to UNIX ls. Options are provided to specify non-default output.\n\n* Improved error messages for arcls and arccp, improved calculation of file checksums.\n\n* Fixed a bug where the check for readability (arcls -c) failed incorrectly in some cases.\n\n* Fixed a bug where metadata from gridftp objects were incorrectly reported.\n\n* arcproxy bugfixes: arcproxy - dteam VO error (#2026), arcproxy does not search \/etc\/vomses recursively (#2118), Segmentation fault with arcproxy with invalid vomses file (#2155)\n\n\n\nDeployment notes:\n\n-----------------\n\n*  With this release the new clients (arc*) utilising the strength of libarcclient and libarcdata2 replace the old clients (ng*).The behaviour and interface of the new clients slightly differs from the old ones, so for compatibility reasons the ng* still distributed as part of the compat package.\n\n* The old arclib is now replaced by the new libraries and tagged as obsolete (though still available).\n\n* Previous clients (ng*) are now available from nordugrid-arc-compat package.\n\n* The new clients (arc*) are available from the nordugrid-arc-client package.\n\n* The libracclient and libarcdata2 libraries are available from the nordugrid-arc package.\n\n* The DMCs and different plugins are available from nordugrid-arc-plugins-needed and nordugrid-arc-plugins-globus (the latter requires globus).\n\n \n\nKnown Issues \n\n-------------\n\n* The new arc* commands are not 100% compatible with the old ng* commands. A detailed analysis of the differences are provided as part of client component documentation.\n\n* Recursive copy using ngcp -r deletes existing files (see nordugrid bug #2132). Use caution when using ngcp -r or use arccp -r instead.\n\n*There are additional non-critical smaller issues registered in NorduGrid bugzilla.\n\n","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.0.0","softwareConfigurationLink":""}