{"name":"emi.glexec_wn","version":"0.8.10","documentationLinks":["http:\/\/www.eu-emi.eu\/kebnekaise-products\/-\/asset_publisher\/4BKc\/content\/gleexec?redirect=http%3A%2F%2Fwww.eu-emi.eu%2Fkebnekaise-products%3Fp_p_id%3D101_INSTANCE_4BKc%26p_p_lifecycle%3D0%26p_p_state%3Dnormal%26p_p_mode%3Dview%26p_p_col_id%3Dcolumn-2%26p_p_col_pos%3D1%26p_p_col_count%3D2"],"target":[{"id":22,"productId":43,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/base","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=2214","status":1}],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"glexec is an extended version of apache suexec. It takes as input a certificate chain, possibly with VOMS extensions, and a user program name to run. It checks authorization, user credentials, proper VOMS attributes and executable name. It acquires local credentials and a local (uid, gid) pair enforcing the local credential on the process. It is basically a suid program. It is used on the cream CE to change identity of the grid user before job submission and this led to idea of using it on the WN to implement traceability and Intra-VO accounting for pilot jobs.","releaseDate":"2011-07-11 20:50:50","majorVersion":0,"minorVersion":8,"revisionVersion":10,"releaseNotes":"\n\n                           What's new\n\nThis version of gLExec and the gLExec workernode introduces the following new features:\n\n    * support for LCMAPS-plugins-tracking-groupid, which enables SGE and Condor tracking GIDs to work across a gLExec call\n\n    * a missing secondary groupNAME is no longer a fatal error.\n\n    * fix a few minor segfault situations.\n\n    * fix crash when \"linger= ...\" is absent.\n\n    * installation of a default glexec.conf file and a default (fully commented-out) lcmaps-glexec.db file.\n\n    * support for specifying lcas and lcmaps db files on the configure cmdline.\n\n    * cleanup of unused files and support for distribution tarball.\n\n\n\nInstallation and configuration\n\n    * Run ldconfig after each update, as the packages don't seem to do this by themselves.\n\n    * All services are recommended to be restarted. gLExec is an exception, as it is not a service.\n\n\n\nKnown issues\n\n    * This version of C-PEP needs to be tested more on root-squashed environments.\n\n    * The verify-proxy plugins fails to verify Terena eScience Personal certificate chains deeper then 5 certificates. 5 is ok, 6 is not.\n\n                          ","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.0.0","softwareConfigurationLink":""}