{"name":"emi.unicore-uvos","version":"1.4.1","documentationLinks":["http:\/\/www.eu-emi.eu\/kebnekaise-products\/-\/asset_publisher\/4BKc\/content\/uvos?redirect=http%3A%2F%2Fwww.eu-emi.eu%2Fkebnekaise-products%3Fp_p_id%3D101_INSTANCE_4BKc%26p_p_lifecycle%3D0%26p_p_state%3Dnormal%26p_p_mode%3Dview%26p_p_col_id%3Dcolumn-2%26p_p_col_pos%3D1%26p_p_col_count%3D2"],"target":[{"id":36,"productId":57,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/base","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=2228","status":1}],"capabilities":["Attribute Authority"],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"UNICORE VO Service (UVOS) is a client-server system, developed to be used as an additional tool for large distributed systems, providing a solution for grid users management. Grid systems, especially UNICORE grid middleware, are the mainspring of the UVOS system. UVOS can be used with different systems, however is designed primarily to support UNICORE grid middleware.","releaseDate":"2011-07-11 20:50:50","majorVersion":1,"minorVersion":4,"revisionVersion":1,"releaseNotes":"\n\n                           What's new for UVOS Server\n\n    * Added support for CRLs (I #3163915)\n\n    * Updated many dependencies, removed deprecated or proprietary code usage. (I #3163913)\n\n    * Added endorsed directory. (I #3163913)\n\n    * Updated underlying security libraries. xmlsec and commons-logging must be in endorsed directory. (I #3163913)\n\n    * Updated to Jetty 6.1.26 (I #3163913)\n\n    * Fixed SF bug #3041189: error occurring in group's authorization policy management.\n\n    * Fixed a bug which occurred in duplicate reporting of implied groups for users being members of multiple child groups. (B #3163916)\n\n    * Fixed a bug which prevented server to function normally when there was no web module installed. (B #3163919)\n\n    * Fixed a bug which resulted incomplete attributes list when querying for all attributes including implied. The error was that not only attributes that were defined in a group where the client had no permission to read were hidden but also all attributes implied by those hidden (while sometimes in a parent group the client had permission to read). (B #3163920)\n\n    * Meaningful error messages are provided when incorrect key alias is configured. (I #3163913)\n\n    * Changed a default logging configuration to be more similar to the other UNICORE servers: daily log file rolling is used now. (I #3163913)\n\n    * Fixed the SF bug #3020090. The fixed memory leak caused the server to hang after serving ca 500000 requests.\n\n\n\nWhat's new for UVOS Client\n\n    * Fixed bug with attribute value encoding. Currently all UTF-8 characters are properly passed to the server, regardless of the local system settings. (B #3163928)\n\n    * Added quit alias to exit\n\n\n\nWhat's new for UVOS webapp\n\n    * Updated for compatibility with UVOS server 1.4.0 (won't work with older versions)\n\n    * Updated to the latest SpringWebFlow 2.0.\n\n    * It is possible to eliminate agreement form. Simply use empty agreement in form definition. (FR #3163908)\n\n    * Option to submit additional CA certificate is not rendered if email identity format was chosen. (FR #3123576)\n\n    * Full verification of submitted certificate was implemented. (FR #3123570)\n\n    * Possibility to enforce additional groups or additional attributes was added. (FR #3163907)\n\n    * It is possible to control in application form whether submission of an additional CA certificate is enabled. (FR #3123576)\n\n\n\nWhat's new for UVOS webauthn\n\n    * Updated for compatibility with UVOS server 1.4.0 (won't work with older versions)\n\n    * Added highly experimental support for SAML Redirect binding which allow to use UVOS with this module installed as IdP for Shibboleth SP.\n\n\n\nDeployment notes\n\n    * NONE - this is the first release of UVOS in RPM packages.\n\n\n\nKnown issues\n\n    * NONE\n\n                          ","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.0.0","softwareConfigurationLink":""}