{"name":"emi.dgas","version":"4.0.2","documentationLinks":["http:\/\/www.eu-emi.eu\/kebnekaise-products\/-\/asset_publisher\/4BKc\/content\/dgas-sensors?redirect=http%3A%2F%2Fwww.eu-emi.eu%2Fkebnekaise-products%3Fp_p_id%3D101_INSTANCE_4BKc%26p_p_lifecycle%3D0%26p_p_state%3Dnormal%26p_p_mode%3Dview%26p_p_col_id%3Dcolumn-2%26p_p_col_pos%3D1%26p_p_col_count%3D2"],"target":[{"id":19,"productId":40,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/base","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=2212","status":1}],"capabilities":["Accounting"],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"DGAS CE sensors are a set of daemons whose responsibility is to get the information available on a\n\nComputing Element for each single job executed by the LRMS, augmenting them with grid related information made available (if it is the case) by the grid job manager. This information is then converted into an Usage Record that is then transferred to the Site HLR for further processing and archival. It is possible to implement many transport mechanisms between sensors and servers. This can be done using a pluggable architecture. Plugins are available to implement a DGAS legacy transport protocol as well as Apache ActiveMQ messaging system.","releaseDate":"2011-07-11 20:50:50","majorVersion":4,"minorVersion":0,"revisionVersion":2,"releaseNotes":"\n\n                           Release notes.\n\n\n\nModules:\n\nemi-dgas-common\n\nemi-dgas-hlr-clients\n\nemi-dgas-hlr-sensors\n\n\n\nDescription\n\nProvides the basic set of DGAS (Distributed Grid Accounting System) accounting sensors, which can parse\n\nthe LRMS and grid-jobmanager accounting logs and produce Usage Records for each job and send them to an accounting server.\n\nSupported LRMS are: LSF,PBS\/Torque,SGE,Condor\n\nChanges since previous releases.\n\nnew sensor is available, which replace the old one. The new sensor, although assuring backward compatibility, provide a pluggable infrastructure which makes it possible to change the Usage Record schema and the record transport protocol. \n\nThe current legacy usage record and communication protocol plugins are available. OGF-UR and ActiveMQ  message producer can be added via the plugin infrastructure.  \n\nThe sensor, right as in previous releases, is composed by two daemons, dgas-urcollector and dgas-pushd.\n\ndgas-urcollector being responsible for retrieving the Usage Record information and dgas-pushd being instead responsible for the communication part. An important change from older version of the sensor is that now sqlite is being used to implement persistent IPC among the two daemons, which replaces the old, file based, mechanism.\n\nAn arbitrary number of DGAS accounting services can be used as information backends. \n\nThe configuration file has been simplified and sensors performance greatly improved.\n\nThe old sensor daemons, although declared obsolete are still provided within the packages to ensure a fail-back strategy for sites already implementing DGAS as an accounting system and not wanting to migrate right now to the new sensors.\n\n                          ","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.0.0","softwareConfigurationLink":""}