{"name":"emi.voms_mysql","version":"2.0.0","documentationLinks":["http:\/\/www.eu-emi.eu\/kebnekaise-products\/-\/asset_publisher\/4BKc\/content\/voms?redirect=http%3A%2F%2Fwww.eu-emi.eu%2Fkebnekaise-products%3Fp_p_id%3D101_INSTANCE_4BKc%26p_p_lifecycle%3D0%26p_p_state%3Dnormal%26p_p_mode%3Dview%26p_p_col_id%3Dcolumn-2%26p_p_col_pos%3D1%26p_p_col_count%3D2"],"target":[{"id":39,"productId":60,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/base","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=2219","status":1}],"capabilities":["Attribute Authority"],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"VOMS (Virtual Organization Membership Service) serves as a central repository for user authorization information, providing support for sorting users into a general group hierarchy, keeping track of their roles, etc. Its functionality may be compared to that of a Kerberos KDC server. The VOMS Admin service is a web application providing tools for administering member databases for VOMS, the Virtual Organization Membership Service. VOMS Admin provides an intuitive web user interface for daily administration tasks and a SOAP interface for remote clients. (The entire functionality of the VOMS Admin service is accessible via the SOAP interface.) The Admin package includes a simple command­-line SOAP client that is useful for automating frequently occurring batch operations, or simply to serve as an alternative to the full blown web interface. It is also useful for bootstrapping the service. This VOMS server uses MySQL as a backend.","releaseDate":"2011-07-11 20:50:50","majorVersion":2,"minorVersion":0,"revisionVersion":0,"releaseNotes":"\n\n                           What's new:\n\n    * Voms packaging has been changed to install into system directories. For example, this means that executables are in \/usr\/bin, \/usr\/sbin, configuration files in \/etc\/voms, etc...\n\n    * A REST interface is available to obtain VOMS attribute certificates.\n\n    * There are no longer dependencies on globus anywhere. However, on-the-wire compatibility with previous versions of VOMS is still maintained.\n\n    * Compatibility with EPEL installation.\n\n    * Installation\/Configuration: https:\/\/twiki.cern.ch\/twiki\/bin\/view\/EMI\/VOMSystemAdministratorGuide\n\n\n\nKnown Issues:\n\n    * None at the moment.\n\n                          ","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.0.0","softwareConfigurationLink":""}