{"name":"emi.argus-ees","version":"0.0.10","documentationLinks":["http:\/\/www.eu-emi.eu\/kebnekaise-products\/-\/asset_publisher\/4BKc\/content\/argus-ees?redirect=http%3A%2F%2Fwww.eu-emi.eu%2Fkebnekaise-products%3Fp_p_id%3D101_INSTANCE_4BKc%26p_p_lifecycle%3D0%26p_p_state%3Dnormal%26p_p_mode%3Dview%26p_p_col_id%3Dcolumn-2%26p_p_col_pos%3D1%26p_p_col_count%3D2"],"target":[{"id":13,"productId":34,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/base","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=2239","status":1}],"capabilities":["Credential Management"],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"The EES is a pluggable, configurable authorisation\n\nservice similar to the Site Central Authorisation Service (SCAS). The role of\n\nthe EES is to ensure that an appropriate site-specific execution environment is\n\nprocured based on the site-agnostic obligations and attributes it receives as\n\ninput in the form of SAML2-XACML2 requests. It runs as a standalone service,\n\nresponding to requests from a Policy Enforcement Point (PEP) which have been\n\naugmented with information from a Policy Decision Point (PDP).","releaseDate":"2011-07-11 20:50:50","majorVersion":0,"minorVersion":0,"revisionVersion":10,"releaseNotes":"\n\n                           This is the initial release of the Execution Environment Service (EES).\n\n\n\nThe role of the EES is to ensure that an appropriate site-specific execution environment is procured based on the site-agnostic obligations and attributes it receives as input in the form of SAML2-XACML2 requests. It runs as a standalone service, responding to requests from a Policy Enforcement Point (PEP) which have\n\nbeen augmented with information from a Policy Decision Point (PDP).\n\n\n\nFrom the outside, the EES can be viewed as an obligation transformer; for example it can be used to transform a site-agnostic obligation for a local account mapping to a site-specific obligation for on-demand virtual machine deployment.\n\n\n\nTo integrate the EES with an existing Argus installation, a separate component called the EES Obligation Handler should be configured in the PEP daemon. For more details regarding integration in Argus, please see the documentation for this component. The EES itself ships with a pre-configured transformer plug-in which extracts PDP data from the SAML2-XACML2 environment attributes. This plug-in is not required when PDP data is not transmitted to the EES.\n\n\n\nThe EES Obligation Handler is tested with the Argus 1.3 PEPd and performs a network call-out to the EES service.\n\n                          ","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.0.0","softwareConfigurationLink":""}