{"name":"emi.bdii-core","version":"1.4.0","documentationLinks":["https:\/\/tomtools.cern.ch\/confluence\/download\/attachments\/983044\/EMI_BDII_sysadmin.pdf"],"target":[],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"Grid information systems are mission-critical components in today's production grid infrastructures. They provide detailed information about grid services which is needed for various different tasks. The EMI information system has a hierarchical structure of three levels. The fundamental building block used in this hierarchy is the Berkley Database Information Index (BDII). Although the BDII has additional complexity, it can be visualized as an LDAP database. The resource level BDII is usually co-located with the grid service and provides information about that service. Each grid site runs a site level BDII. This aggregates the information from all the resource level BDIIs running at that site. The top level BDII aggregates all the information from all the site level BDIIs and hence contains information about all grid services. There are multiple instances of the top level BDII in order to provide a fault tolerant, load balanced service. The information system clients query a top level BDII to find the information that they require.","releaseDate":"2012-10-09 16:04:39","majorVersion":1,"minorVersion":4,"revisionVersion":0,"releaseNotes":"    A new cron job is run every hour to execute the glue-validator script and validate the information published by the BDII against glue 1.3 and glue 2.0 schema. The results are logged in:\n\n        \/var\/log\/glue-validator\/glue1-validator.log\n\n        \/var\/log\/glue-validator\/glue2-validator.log\n\n    IPv6 support included with the new yaim variable BDII_IPV6_SUPPORT, which is set to \"no\" by default. If set to \"yes\";, it enables both IPv4 and IPv6 support.\n\n    Fixed GLUE 2 bugs in the service information provider affecting VOMS and MyProxy, and improved the README files.\n\n    glite-yaim-bdii cleaning removing old variables and functions. Fixed minor errors printed at configuration time (this affected only the top level BDII).\n\n    emi-resource-information-service metapackage now depends on glite-yaim-bdii and glue-validaror-cron.\n\n    Improved description and summary of glue-validator rpm.\n\n","changeLog":"    A new cron job is run every hour to execute the glue-validator script and validate the information published by the BDII against glue 1.3 and glue 2.0 schema. The results are logged in:\n\n        \/var\/log\/glue-validator\/glue1-validator.log\n\n        \/var\/log\/glue-validator\/glue2-validator.log\n\n    IPv6 support included with the new yaim variable BDII_IPV6_SUPPORT, which is set to \"no\" by default. If set to \"yes\";, it enables both IPv4 and IPv6 support.\n\n    Fixed GLUE 2 bugs in the service information provider affecting VOMS and MyProxy, and improved the README files.\n\n    glite-yaim-bdii cleaning removing old variables and functions. Fixed minor errors printed at configuration time (this affected only the top level BDII).\n\n    emi-resource-information-service metapackage now depends on glite-yaim-bdii and glue-validaror-cron.\n\n    Improved description and summary of glue-validator rpm.\n\n","repositoryURL":"sw\/production\/umd\/2","distributionType":"UMD","distributionVersion":"2.2.0","softwareConfigurationLink":""}