{"name":"emi.storm","version":"1.11.1","documentationLinks":["http:\/\/italiangrid.github.io\/storm\/documentation.html"],"target":[],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"\n\n          StoRM (STOrage Resource Manager) is a storage manager service (SRM) for generic disk based storage system, compliant with the standard SRM interface version 2.2. StoRM provides data management capabilities in a Grid environment to share, access and transfer data among heterogeneous and geographically distributed data centres.In particular, StoRM works on each POSIX filesystems (ext3, ext4, xfs, basically on everything than can be mounted on a Linux machine) but it also brings in Grid the advantages of high performance storage systems based on cluster file system ( such as GPFS from IBM or Lustre from Sun Microsystems ) supporting direct access (native POSIX I\/O call) to shared files and directories, as well as other standard Grid access protocols. StoRM is adopted in the context of WLCG computational Grid framework.\n\n      ","releaseDate":"2013-06-26 11:32:20","majorVersion":1,"minorVersion":11,"revisionVersion":1,"releaseNotes":"\n\n          This StoRM release provides the bug fixes and improvements for the StoRM services.\n\n          Bug fixes\n\n\n\n          STOR-172 : StoRM now correctly publishes information about storage area sizes in the information system.\n\n          STOR-148 , STOR-10 : StoRM now leverages quota limits information gathered from the underlying GPFS filesystem to compute a storage area size.\n\n          STOR-130 : StoRM GridHTTPs server is now correctly registered to start at system boot.\n\n          STOR-117 : Duplicate prepare-to-get calls on a SURL are now correctly handled.\n\n          STOR-113 : The StoRM YAIM module does not try to configure permissions on existing configured storage areas. It is assumed (and documented) that the correct permissions are set by the system administrator before running YAIM.\n\n          STOR-109 : The Java JDK dependency has been fixed so that all StoRM packages explicitly requires OpenJDK.\n\n          Enhancements\n\n          STOR-230: The StoRM WebDAV propfind implementation performance has been improved.\n\n          For more info see STORM v. 1.11.1\n\n      ","changeLog":"\n\n          http:\/\/italiangrid.github.io\/storm\/release-notes-v1_11_1.html\n\n      ","repositoryURL":"sw\/production\/umd\/3","distributionType":"UMD","distributionVersion":"3.1.0","softwareConfigurationLink":""}