{"name":"emi.bdii-core","version":"1.5.1","documentationLinks":["http:\/\/gridinfo.web.cern.ch\/ "],"target":[],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"\n\n          Grid information systems are mission-critical components in today's production grid infrastructures. They provide detailed information about grid services which is needed for various different tasks. The EMI information system has a hierarchical structure of three levels. The fundamental building block used in this hierarchy is the Berkley Database Information Index (BDII). Although the BDII has additional complexity, it can be visualized as an LDAP database. The resource level BDII is usually co-located with the grid service and provides information about that service. Each grid site runs a site level BDII. This aggregates the information from all the resource level BDIIs running at that site. The top level BDII aggregates all the information from all the site level BDIIs and hence contains information about all grid services. There are multiple instances of the top level BDII in order to provide a fault tolerant, load balanced service. The information system clients query a top level BDII to find the information that they require.\n\n      ","releaseDate":"2013-06-26 11:32:20","majorVersion":1,"minorVersion":5,"revisionVersion":1,"releaseNotes":"\n\n          Bug fix release affecting all BDII flavours:\n\n          BUG #101237: Obsolete GLUE 2 entries were never removed from the BDII since the DNs were transformed into lower case and GLUE 2 is case sensitive. The correct case is now preserved and entries are properly deleted. This bug was affecting all BDII flavours.\n\n          BUG #101090: Missing symlink to a customised LDAP DB configuration file allowing for better performance tuning of the DB. The link was already available for GLUE 1 but not for GLUE 2. This should improve the performance of top BDIIs which can be otherwise degraded after GLUE 2 is wideliy published by all EGI sites.\n\n          Installation and configuration: only the top BDII needs to be restarted\n\n      ","changeLog":"\n\n          http:\/\/www.eu-emi.eu\/releases\/emi-3-monte-bianco\/updates\/-\/asset_publisher\/5Na8\/content\/update-5-03-06-2013-v-3-3-0-1#What_s_new \n\n      ","repositoryURL":"sw\/production\/umd\/3","distributionType":"UMD","distributionVersion":"3.1.0","softwareConfigurationLink":""}