{"name":"emi.voms","version":"3.0.1","documentationLinks":["https:\/\/github.com\/italiangrid\/voms\/wiki"],"target":[{"id":168,"productId":332,"platform":"debian-squeeze","arch":"amd64","repositoryURL":"sw\/production\/umd\/3\/debian\/dists\/squeeze-updates\/main\/binary-amd64","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=5738","status":1}],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":" The Virtual Organization Membership Service (VOMS) is an attribute authority which serves as central repository for VO user authorization information, providing support for sorting users into group hierarchies, keeping track of their roles and other attributes in order to issue trusted attribute certificates and SAML assertions used in the Grid environment for authorization purposes.\n\n\n\nVOMS is composed of two main components:\n\n\n\nthe VOMS core service, which issues attribute certificates to authenticated clients the VOMS Admin service, which is used by VO manager to administer VOs and manage user membership details. ","releaseDate":"2013-06-26 11:32:20","majorVersion":3,"minorVersion":0,"revisionVersion":1,"releaseNotes":"This VOMS and VOMS Admin release provides several bug fixes and improvements in the VOMS clients, APIs and server modules.\n\nVOMS documentation now lives on GITHUB at https:\/\/github.com\/italiangrid\/voms\/wiki.\n\nEMI 3 VOMS drops support for YAIM. The voms-configure utility must be used instead to manage deployment and reconfiguration of the VOMS services (more details in the VOMS system administrator and VOMS Admin user guide).\n\nVOMS Admin server v. 3.0.0 introduces a new deployment model for the service. The VOMS Admin service does not run anymore as a web application in the Tomcat application server but as a separate standalone daemon process. In particular, one daemon process runs for each configured VO, as it happens for VOMS core service.","changeLog":"http:\/\/www.eu-emi.eu\/releases\/emi-3-montebianco\/products\/-\/asset_publisher\/5dKm\/content\/voms-2#RfC","repositoryURL":"sw\/production\/umd\/3","distributionType":"UMD","distributionVersion":"3.1.0","softwareConfigurationLink":""}