{"name":"emi.bdii-core","version":"1.1.0","documentationLinks":["http:\/\/www.eu-emi.eu\/emi-1-kebnekaise-updates\/-\/asset_publisher\/Ir6q\/content\/update-6-01-09-2011"],"target":[{"id":75,"productId":96,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/updates","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=2820","status":1}],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"The resource-level BDII is an instance of the BDII that contains information about a Grid Service and is typically deployed with the service itself. It consists of an OpenLDAP database that is periodically updated by a parallel process that obtains information about the Grid Service from one or more information sources.","releaseDate":"2011-10-31 16:52:37","majorVersion":1,"minorVersion":1,"revisionVersion":0,"releaseNotes":"\n\nWhat's new:\n\nThis release of BDII core addresses a number of minor issues reported with the initial EMI 1 release. Most of the issues fixed are related to packaging and the templates provided by the glite-info-provider-service component.\n\n\n\nOne new useful feature has been included which is an improved status command which detects that the BDII is not updating. The yaim configuration has also been improved so that the BDII will automatically start on reboot. Improve status command to detect hanging BDII.\n\n\n\nVersion 1.7.0 of glite-info-provider-service has the following updates in addtion:\n\n\n\n    * There is a completely new GLUE 2 provider for VOMS. This should be called like:\n\n          o glite-info-glue2-voms glite-info-glue2-voms.conf[,glite-info-glue2-voms-admin.conf] <site-name> \n\n\n\nwhere the voms-admin config file should only be included if voms-admin is running on the server. The relevant config templates are glite-info-glue2-voms.conf.template and glite-info-glue2-voms-admin.conf.template, and it should normally be possible to use them without modification. This provider creates a single GLUE2Service object with one GLUE2Endpoint per VO for each of voms and voms-admin.\n\n\n\n    * For the WMS (wmproxy) the DN is now extracted using openssl rather than grid-cert-info, but there should be no effect on the published information. Also the GLUE 2 publisher will have GLUE2EndpointServingState: draining if a file \/etc\/glite-wms\/.drain exists.\n\n    * The GLUE 2 information for the RTEPublisher (software tag publisher) has been revamped to fit within the ComputingService structure in CREAM. In particular the service type (EndpointInterfaceName) is now org.glite.ce.ApplicationPublisher.\n\n    * There is a new GLUE 2 template for the CEMon, again intended to fit within the ComputingService structure for CREAM.\n\n    * The VOMS, WMS (wmproxy) and CEMon templates and scripts have been updated to reflect the new paths, environment variables, RPM names and documentation locations in EMI, and hence are no longer compatible with gLite installations.\n\n    * A bug in the GLUE 2 publisher has been fixed that prevented the publication of multiple Extension objects with the same Key.\n\n    * The old beta-test GLUE 2 publisher has been renamed and replaced by a script which calls the new publisher, so any service which is still configured to use it will publish in the more up-to-date format.\n\n    * The wrapper around the service status query has been extended to allow extra arguments to be passed to the init.d script. This is used by voms and should otherwise be transparent. \n\n\n\nThis release also include the BDII Nagios probe. This probe is already running in production but has been repackaged for release within EMI. ","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.3.0","softwareConfigurationLink":""}