{"name":"emi.glexec_wn","version":"1.0.1","documentationLinks":["http:\/\/www.eu-emi.eu\/emi-1-kebnekaise-updates\/-\/asset_publisher\/Ir6q\/content\/update-7-22-09-2011"],"target":[{"id":79,"productId":100,"platform":"sl5","arch":"x86_64","repositoryURL":"sw\/production\/umd\/1\/sl5\/x86_64\/updates","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=2932","status":1}],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"glexec is an extended version of apache suexec. It takes as input a certificate chain, possibly with VOMS extensions, and a user program name to run. It checks authorization, user credentials, proper VOMS attributes and executable name. It acquires local credentials and a local (uid, gid) pair enforcing the local credential on the process. It is basically a suid program. It is used on the cream CE to change identity of the grid user before job submission and this led to idea of using it on the WN to implement traceability and Intra-VO accounting for pilot jobs.","releaseDate":"2011-10-31 16:52:37","majorVersion":1,"minorVersion":0,"revisionVersion":1,"releaseNotes":"\n\n                           What's new\n\n\n\n    * This update of the gLExec workernode fixes a minor bug in the yaim configuration that would cause some variables to have the wrong (or no) default value.\n\n    * The CREAM CE uses gLExec and LCMAPS to resolve a Unix account in one of its deployment options. The certificate chain will be checked by the lcmaps-plugins-verify-proxy component, launched by the gLExec\/LCMAPS combination. The component triggers an X509_V_ERR_PROXY_PATH_LENGTH_EXCEEDED error code, even while the chain is fully valid. There are three important triggers required:\n\n         1. The user is required to use a certificate issued from a CA certificate with a path length constraint set to 0 (=zero). This is the case for the Terena eScience Personal, Terena SSL and the FNAL CA.\n\n         2. The job must flow through the CREAM CE frontend service, not directly to gLExec on the shell\n\n         3. The proxy certificate chain must have at least two delegations, or more to trigger the error. \n\n\n\nThis fix will mitigate the problems in OpenSSL (or Globus OpenSSL) by retrying the Path Length checks for RFC5280 and RFC3820 though a new routine that double checks if the chain is really invalid according to the initially stated failure condition.\n\n\n\nFor a detailed background story: cream-did-it-using-bugs-in-path-length \n\n                          ","changeLog":"\n\n                          Put the Change logs here (multiline field)\n\n                          ","repositoryURL":"sw\/production\/umd\/1","distributionType":"UMD","distributionVersion":"1.3.0","softwareConfigurationLink":""}