{"name":"emi.gridsite","version":"2.0.4","documentationLinks":["http:\/\/www.eu-emi.eu\/releases\/emi-3-montebianco\/products\/-\/asset_publisher\/5dKm\/content\/gridsite-2#Doc"],"target":[{"id":167,"productId":300,"platform":"debian-squeeze","arch":"amd64","repositoryURL":"sw\/production\/umd\/3\/debian\/dists\/squeeze\/main\/binary-amd64","gpgkey":null,"rpms":[],"apicallback":"http:\/\/admin-repo.egi.eu\/api\/report\/release\/xml?id=5237","status":1}],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"The Module Architecture implemented by GridSite extends Apache by adding extra components at the access control and HTTP method execution layers, and supports CGI services supplied with GridSite or written by third parties. mod_gridsite is a loadable module for the Apache web server which provides access control and page formatting for GridSite HTTP(S) Fileservers, Websites and Web Services hosts. mod_gridsite also intercepts some processing in the standard mod_ssl module to support GSI Proxies and VOMS attribute certificates, as well as the normal X.509 client certificates. The verification of these credentials is handled by functions within mod_gridsite and the main GridSite shared library, without the need to patch or rebuild mod_ssl.","releaseDate":"2013-05-14 17:54:56","majorVersion":2,"minorVersion":0,"revisionVersion":4,"releaseNotes":"gridsite_mod internals have been significantly refactored and new authentication features have been introduced by a dependence on EMI's common authentication library (caNl).\n\nRarely used programs (gsexec, slashgrid) have been removed from the distribution.","changeLog":"http:\/\/www.eu-emi.eu\/releases\/emi-3-montebianco\/products\/-\/asset_publisher\/5dKm\/content\/gridsite-2#RfC","repositoryURL":"sw\/production\/umd\/3","distributionType":"UMD","distributionVersion":"3.0.0","softwareConfigurationLink":""}