{"name":"emi.dcache","version":"2.2.5","documentationLinks":["http:\/\/www.dcache.org\/manuals\/Book-2.1\/index-fhs.shtml"],"target":[],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":" dCache is a distributed storage solution. It organises storage across computers so the combined storage can be used without the end-users being aware of where their data is stored. They simply see a large amount of storage.\n\n\n\nBecause end-users do not need to know on which computer their data is stored, it can be migrated from one computer to another without any interruption of service. As a consequence, (new) servers may be added to or taken away from the dCache storage cluster at any time.\n\n\n\ndCache supports requesting data from a tertiary storage system. Such systems typically store data on magnetic tapes instead of disks, which must be loaded and unloaded using a tape robot. The main reason for using tertiary storage is the better cost-efficiency, archiving a very large amount of data on rather inexpensive hardware. In turn the access latency for archived data is significantly higher.\n\n\n\ndCache also supports many transfer protocols (allowing users to read and write to data). These have a modular deployment, allowing dCache to support expanded capacity by providing additional front-end machines.\n\n\n\nAnother performance feature of dCache is hot-spot data migration. In this process, dCache will detect when files are requested very often. If this happens, dCache can generate duplicates of the popular files on other computers. This allows the load to be spread across multiple machines, so increasing throughput.\n\n\n\nThe flow of data within dCache can also be carefully controlled. This is especially important for large sites as chaotic movement of data may lead to suboptimal usage. Instead, incoming and outgoing data can be marshaled so they use designated resources guaranteeing better throughput and improving end-user experience.\n\n\n\ndCache provides a comprehensive administrative interface for configuring the dCache instance. ","releaseDate":"2012-12-17 19:06:42","majorVersion":2,"minorVersion":2,"revisionVersion":5,"releaseNotes":"dcap-2.47.7-1:\n\n\n\n    The use of limited proxies resulted in gsi dcap getting stuck on client side. This release fixes the issue.\n\n","changeLog":"dcap-2.47.7-1:\n\n\n\n    The use of limited proxies resulted in gsi dcap getting stuck on client side. This release fixes the issue.\n\n","repositoryURL":"sw\/production\/umd\/2","distributionType":"UMD","distributionVersion":"2.3.1","softwareConfigurationLink":""}