{"name":"emi.dcache","version":"2.2.4","documentationLinks":["http:\/\/www.dcache.org\/manuals\/index.shtml"],"target":[],"capabilities":[],"currentState":"deployed","technologyProvider":"European Middleware Initiative","contact":"cristina.aiftimiei@pd.infn.it","technicalContact":"cristina.aiftimiei@pd.infn.it","description":"Provide a system for storing and retrieving huge amounts of data, distributed among a large number of heterogenous server nodes, under a single virtual filesystem tree with a variety of standard access methods. Depending on the Persistency Model, dCache provides methods for exchanging data with backend (tertiary) Storage Systems as well as space management, pool attraction, dataset replication, hot spot determination and recovery from disk or node failures. Connected to a tertiary storage system, the cache simulates unlimited direct access storage space. Data exchanges to and from the underlying HSM are performed automatically and invisibly to the user. Beside HEP specific protocols, data in dCache can be accessed via NFSv4.1 (pNFS) as well as through WebDav. ","releaseDate":"2012-11-20 18:12:01","majorVersion":2,"minorVersion":2,"revisionVersion":4,"releaseNotes":"http:\/\/www.eu-emi.eu\/emi-2-matterhorn\/updates\/-\/asset_publisher\/9AgN\/content\/update-3-25-09-2012-v-2-3-0-1#dCache_v_2_2_4_task_31465","changeLog":"A potential problem, where chimera can leak a database connection has been fixed. Affected sites will see list full in their log file. Several xrootd related race conditions and protocol violations in the pool have been fixed. Fixed an issue preventing upload through SRM to the root-directory of the name space. Support for running the srm service so that it directly uses a custom kpwd file (independent of the rest of dCache) has been removed. All SRM authentication and authorisation activity must now go through gPlazma. Note that it is possible to configure SRM to use a different gPlazma configuration from the rest of dCache by embedding the gPlazma (see useGPlazmaAuthorizationModule and useGPlazmaAuthorizationCell options). These options, along with gPlazmas kpwd plugin, allow for an equivalent configuration. The srm service now listens on two ports. These are, by default, 8443 (as before) and 8445. Port 8443 continues to be for SRM clients that use GSI-based communication and the new port is for SRM clients that use SSL. While the SSL port is configurable, it is recommended to use the default as this an agreed port-number for SSL-based SRM traffic.\n\n    Resolved a conflict between the httpd service with billing plots enabled and the pin manager. Before those two service could not co-exist in the same dCache domain. Improved SQL standards compliance of replica manager. Fixed database related bugs that would prevent replica manager from operating within acceptable parameters. We now use the loopback interface when talking to rpcbind\/portmap. Now, admins do not need to open portmapper port (111) in the firewalls. For nfs we switch to grizzly 2.2.9 with many improvements and bug fixes including internal IO buffers recycling. In the webadmin we can filter content of CellInfo, Pool Queue and Active Transfers tables. And we fixed 'page expired exception' which used to appear when page was left idle for more than 24 hours. For webdav we fixed a problem in the WebDAV door in which proxied reads would pause 5 to 10 seconds after the transfer. Also fixed an authorization problem in the WebDAV door relating to basic authentication. dCache erroneously replied with '405 method not allowed' when it should have replied '401 unauthorized'. Also resolved a compatibility issue between the dCache WebDAV door and Gnome. The problem prevented dCache WebDAV shares from being mounted in Gnome.\n\n    Gplazma2 supports gplazma1 as a plugin. The default configuration of dCache will work as the gplazma1 is configured. Any existing gplazma1 and gplazma2 configurations will work as before. NOTICE: we have no experience in combining gplazma1 plugin with other gplazma2 plugins.\n\n    Another useful addition are two new commands to the admin interface when looking at the! gPlazma cell. test login replaces the existing get mapping command. It shows the result of a login attempt but is more flexible when describing which principals have been identified for the user. The second is explain login. This command uses the same format as test login but provides detailed information on how the login was processed. The result of each processed plugin is explained in a tree structure.\n\n    For the poolmanager we suggest people regenerate poolmanager.conf after upgrade by running the save command in the pool manager. This will ensure compatibility with future releases.\n\n    Some of dCache properties accept only a few possible values (e.g., either true or false). The parsing of such properties is now more robust and incorrect values will be reported. Previously, incorrect values would take some default value. Now, if a property is configured with a value outside the set of acceptable values then an error is reported and dCache refuses to start. As part of this process, some equivalent property values are no longer considered the same; for example, some properties took true, True and TRUE as values that would result in the same behaviour but now only true is valid. After upgrading, we recommend you run the dcache check-config command to check your configuration.\n\n    dcache service is not enabled by default. Admins have to enable it by hand if required: \/sbin\/chkconfig --add dcache-server\n\n","repositoryURL":"sw\/production\/umd\/2","distributionType":"UMD","distributionVersion":"2.3.0","softwareConfigurationLink":""}